[[Subreddit(display_name='taiwan'), 'Weekly Questions & Discussion Thread (December 08, 2019)', 'e7g13m', 'https://www.reddit.com/r/taiwan/comments/e7g13m/weekly_questions_discussion_thread_december_08/', "Maybe you have a question about traveling or living in Taiwan, or just have something you've had on your mind that doesn't really warrant its own thread. If so, then it belongs here!\n\n*Use upvotes to let people know you appreciate their help & feedback!*\n\nMost questions have been asked on this sub. You will find great resources by using the search function and also by using Google. To prevent the sub from being continually flooded with itinerary requests or questions about where to find [random object], please post questions and requests here. Thank you for your understanding!\n\n**This thread's default sort is NEW.**\n\n**The thread changes every week on Sunday.**\n\n[Previous Discussion Threads](https://www.reddit.com/r/taiwan/search?q=weekly+discussion+%26+questions+thread&restrict_sr=on&sort=relevance&t=all)."], [Subreddit(display_name='taiwan'), 'Taiwan to launch satellites every year over coming decade: Tsai', 'e8g8ib', 'https://en.rti.org.tw/news/view/id/2002330', ''], [Subreddit(display_name='taiwan'), 'Will Kinmen, Taiwan’s Frontline, Become the Next Crimea?', 'e8fvwr', 'https://english.cw.com.tw/article/article.action?id=2612', ''], [Subreddit(display_name='taiwan'), 'Taiwan News: Let’s call out Xi Jinping as the dictator that he is. Explaining our editorial decision to stop conferring legitimacy on Xi by referring to him as president of China', 'e84zmg', 'https://www.taiwannews.com.tw/en/news/3831190', ''], [Subreddit(display_name='taiwan'), 'Needing to vent about my Granny', 'e8g57u', 'https://www.reddit.com/r/taiwan/comments/e8g57u/needing_to_vent_about_my_granny/', "I am just in need of a place to vent.\nI graduated from the Uni 1 1/2 years ago from the UK, marking my 10 years stay from the UK, dispite the long leave, I've always cared about Taiwan and kept an eye on the politics.\n\nAnd yesturday, whiles dining with my grandparents and my uncles, My grandparents found out that I have stayed enough to have voting rights for the presdential election next year.\n\nAs soon as my granny found out, she rushed in excitement and told me that she would give me 1000 twd, and that I should go vote for a candadate Which I would not mention.\n\nAnd frankly, I don't think I have ever been so dissapointed with somebody that I've stopped being mad all together, and just felt sad about the whole ordeal, I don't know is the fact that she thought she could buy my vote with a mear 1000 twd, or the fact that she thought my opnions doesnt matter at all.\n\nI knew my mother isnt voting the same candadate as I am, but that is fine as it is the rights given to us to vote for who ever represents us well, and I respect that my mother does not try to change my opnion.\n\nHowever I've felt this drew the line and I've felt that I've lost nearly all my respects to my granny.\n\nThat is all, I've just needed a space to vent."], [Subreddit(display_name='taiwan'), 'Best universities in Taiwan (curious about options outside Taipei) to learn Mandarin in?', 'e8jwoj', 'https://www.reddit.com/r/taiwan/comments/e8jwoj/best_universities_in_taiwan_curious_about_options/', "Hi all,\n\nI'm considering applying to the Huayu scholarship and was just curious what schools you would recommend and for those of you who have studied Mandarin in Taiwan what your experiences were. Also, are all the good programs in Taipei or are there good schools outside the capital city?  \n\nThanks!"], [Subreddit(display_name='taiwan'), 'Facebook Video of Crayfish Grabbing its Own Claw Goes Viral in Taiwan', 'e8ilsv', 'https://www.facebook.com/angrycrustacean/', ''], [Subreddit(display_name='taiwan'), 'Visa for taiwan', 'e8hkav', 'https://www.reddit.com/r/taiwan/comments/e8hkav/visa_for_taiwan/', "Hey guys I am a broke ass student from Myanmar living in China and have a resident(student) visa there.  My roomate is from taiwan and i want to follow him back to taiwan in chinese new year but the thing is i need a visa. There's the Evisa online for Myanmar but i also read something like that is for only visa for departure from myanmar airports. So, for I have a resident (Student) visa for China, does it complicate the process? thanks"], [Subreddit(display_name='taiwan'), 'Single-use tableware ban to start next month: EPA', 'e83vmr', 'http://www.taipeitimes.com/News/taiwan/archives/2019/12/09/2003727239', ''], [Subreddit(display_name='taiwan'), 'Gathered 70 Saab 9000 cars in one place (Taiwan Squadron)', 'e87i5r', 'https://www.saabplanet.com/target-100-saab-9000-event/', '']]